print("please insert a number")
x=int(input())      #Ζητάω από τον χρήστη να μου εισάγει έναν αριθμό από το 2 εως το 1000000
while (x>1000000 or x<=1 ):        #Έλεγχος εγκυρότητας για τον αριθμό που εισάγει ο χρήστης
    print("please insert a number lower than 1000000 and bigger than 1")
    x=int(input())
p=1                 #Αρχικοποιω την μεταβλητή p η οποία στο τέλος το πρόγραμμα προσπαθεί να την μετατρέψει σε τιμή ίση με την μεταβλητή χ που έδωσε ο χρήστης
lopi=""             #Αρχικοποιώ μία μεταβλητή που ονομάζεται lopi που θα είναι το string που θα δείχνει το γινόμενο
for i in range(2,1000000):              #Σε αυτό το loop δίνονται αριθμοί απο το 2 εώς το 10000000
    if(i<=1000):                        #Προκειμένου να αποφύγω πράξεις μεγάλων αριθμών που δυσχεραίνουν το έργο του προγράμματος δουλεύω με εκθέτες απο το 1 εως το 30 για αριθμούς μικρότερου ή ίσους απο το 1000 δίοτι 1000 σε δύναμη 30 δίνει λίγο παραπάνω απο 1000000 
      for j in range(30,0,-1):
         if((i%3!=0 and i%5!=0 and i%7!=0 and i%2!=0)or (i==2 or i==3 or i==7 or i==5)):           #Δουλεύω για τα i που δεν είναι πολλαπλάσια του 2,3,5,7 εκτός από το 2,3,5,7
          if(x%(i**j)==0) :  # Αν λοιπόν το x διαιρείται με την δύναμη που έφτιαξα τότε γεμιζω το lopi πολλαπλασιαζω το p και διαιρω το x
              lopi+="("+str(i)+"**"+str(j)+")"             
              p*=i**j
              x/=(i**j)
    else:
        if(((i)%3!=0 and (i)%5!=0 and (i)%7!=0 and (i)%2!=0)or (i==2 or i==3 or i==7 or i==5)):        #Το ίδιο και για αριθμούς που είναι μεγαλύτεροι του 1000
             j=1
             if(x%(i**j)==0) :
              lopi+="("+str(i)+"**"+str(j)+")"
              p*=i**j
              x/=(i**j)
if(x!=1 and lopi!=""):              #Στην περίπτωση που δεν επιτεύχθηκε ανάλυση του αριθμού σε γινόμενο πρώτων ,ενώ ταυτόχρονα το πρόγραμμα γέμισε την μεταβλητή lopi με κάποιους αριθμούς που διαιρόντουσαν με το χ τότε θα εμφανίζεται το παρακάτω μήνυμα  
 print("the number can divided only with those numbers "+str(lopi)+" as a result the division transformed to "+str(x)+" and this number cant divided with other number")
if(lopi!=""): # Στην περίπτωση που ο αριθμός κατάφερε να αναλυθεί σε γινόμενο πρώτων τότε  θα εμφανίζεται η μεταβλητη p που είναι το γινόμενο και η μεταβήτή lopi που περιέχει αναλυτικά όλο το γινόμενο 
 print(lopi,p )
else:  #Σε κάθε άλλη περίπτωση που αριθμός δεν κατάφερε να αναλυθεί σε γινόμενο πρώτων θα εμφανίζει το παρακάτω μήνυμα
 print("the number can't transform to product of prime numbers")
